InitiateMeterInstallation_Request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Header>
    <MultiSpeakMsgHeader MajorVersion="integer" MinorVersion="integer" Build="integer" Branch="integer" BuildString="PR or RC or Branch or Release or Other or Unknown" UserID="string" Pwd="string" AppName="string" AppVersion="string" Company="string" DefaultCurrencyCode="USD or EUR or AED or AFN or ALL or AMD or ANG or AOA or ARS or AUD or AWG or AZN or BAM or BBD or BDT or BGN or BHD or BIF or BMD or BND or BOB or BOV or BRL or BSD or BTN or BWP or BYR or BZD or CAD or CDF or CHE or CHF or CHW or CLF or CLP or CNY or COP or COU or CRC or CUP or CVE or CZK or DJF or DKK or DOP or DZD or EEK or EGP or ERN or ETB or FJD or FKP or GBP or GEL or GHS or GIP or GMD or GNF or GTQ or GYD or HKD or HNL or HRK or HTG or HUF or IDR or ILS or INR or IQD or IRR or ISK or JMD or JOD or JPY or KES or KGS or KHR or KMF or KPW or KRW or KWD or KYD or KZT or LAK or LBP or LKR or LRD or LSL or LTL or LVL or LYD or MAD or MDL or MGA or MKD or MMK or MNT or MOP or MRO or MUR or MVR or MWK or MXN or MXV or MYR or MZN or NAD or NGN or NIO or NOK or NPR or NZD or OMR or PAB or PEN or PGK or PHP or PKR or PLN or PYG or QAR or RON or RSD or RUB or RWF or SAR or SBD or SCR or SDG or SEK or SGD or SHP or SKK or SLL or SOS or SRD or STD or SYP or SZL or THB or TJS or TMM or TND or TOP or TRY or TTD or TWD or TZS or UAH or UGX or USN or USS or UYU or UZS or VEF or VND or VUV or WST or XAF or XAG or XAU or XBA or XBB or XBC or XBD or XCD or XDR or XFU or XOF or XPD or XPF or XPT or XTS or XXX or YER or ZAR or ZMK or ZWD or ADF or ADP or ATS or BEF or CYP or DEM or ESP or FIM or FRF or GRD or IEP or ITL or LUF or MCF or MTL or NLG or PTE or SIT or SML or VAL or XEU or Other" CSUnits="feet or meters or USSurveyFeet or other" CoordinateSystemName="string" CoordinateSystemAuthority="string" CoordinateSystemAuthorityCode="string" Datum="string" SessionID="string" PreviousSessionID="string" ObjectsRemaining="integer" LastSent="string" RegistrationID="string" MessageID="string" TimeStamp="dateTime" Context="Production or Testing or Development or Study or Training or Other" AuditID="string" AuditPassword="string" xmlns="http://www.multispeak.org/Version_4.1_Release" />
  </soap12:Header>
  <soap12:Body>
    <InitiateMeterInstallation xmlns="http://www.multispeak.org/Version_4.1_Release">
      <installLocations>
        <serviceLocation>
          <customerID>string</customerID>
          <description>string</description>
          <facilityName>string</facilityName>
          <serviceAddress>
            <address1>string</address1>
            <address2>string</address2>
            <detailedAddressFields xsi:nil="true" />
            <townCode>string</townCode>
            <city>string</city>
            <state>string</state>
            <postalCode>string</postalCode>
            <country>string</country>
          </serviceAddress>
          <SIC>string</SIC>
          <siteID>string</siteID>
          <graphicSymbolList>
            <graphicSymbol xsi:nil="true" />
            <graphicSymbol xsi:nil="true" />
          </graphicSymbolList>
          <annotationList>
            <genericAnnotationFeature xsi:nil="true" />
            <genericAnnotationFeature xsi:nil="true" />
          </annotationList>
          <network>
            <boardDist>string</boardDist>
            <taxDist>string</taxDist>
            <franchiseDist>string</franchiseDist>
            <schoolDist>string</schoolDist>
            <district>string</district>
            <county>string</county>
            <cityCode>string</cityCode>
            <city>string</city>
            <state>string</state>
            <postalCode>string</postalCode>
            <country>string</country>
            <section>string</section>
            <township>string</township>
            <range>string</range>
            <subdivision>string</subdivision>
            <block>string</block>
            <lot>string</lot>
          </network>
          <electricServiceList>
            <electricService xsi:nil="true" />
            <electricService xsi:nil="true" />
          </electricServiceList>
          <waterServiceList>
            <waterService xsi:nil="true" />
            <waterService xsi:nil="true" />
          </waterServiceList>
          <gasServiceList>
            <gasService xsi:nil="true" />
            <gasService xsi:nil="true" />
          </gasServiceList>
          <propaneServiceList>
            <propaneService xsi:nil="true" />
            <propaneService xsi:nil="true" />
          </propaneServiceList>
          <otherServiceList>
            <otherService xsi:nil="true" />
            <otherService xsi:nil="true" />
          </otherServiceList>
          <phoneList>
            <phoneNumber xsi:nil="true" />
            <phoneNumber xsi:nil="true" />
          </phoneList>
          <specialNeeds>string</specialNeeds>
          <serviceOrderList>
            <serviceOrder xsi:nil="true" />
            <serviceOrder xsi:nil="true" />
          </serviceOrderList>
          <workList>
            <workID>string</workID>
            <workID>string</workID>
            <work xsi:nil="true" />
            <work xsi:nil="true" />
          </workList>
          <workOrderList>
            <workOrder xsi:nil="true" />
            <workOrder xsi:nil="true" />
          </workOrderList>
          <maintenanceOrderList>
            <maintenanceOrder xsi:nil="true" />
            <maintenanceOrder xsi:nil="true" />
          </maintenanceOrderList>
          <contactInfo>
            <phoneList xsi:nil="true" />
            <eMailList xsi:nil="true" />
            <addressList xsi:nil="true" />
            <otherContactInformation xsi:nil="true" />
          </contactInfo>
        </serviceLocation>
        <serviceLocation>
          <customerID>string</customerID>
          <description>string</description>
          <facilityName>string</facilityName>
          <serviceAddress>
            <address1>string</address1>
            <address2>string</address2>
            <detailedAddressFields xsi:nil="true" />
            <townCode>string</townCode>
            <city>string</city>
            <state>string</state>
            <postalCode>string</postalCode>
            <country>string</country>
          </serviceAddress>
          <SIC>string</SIC>
          <siteID>string</siteID>
          <graphicSymbolList>
            <graphicSymbol xsi:nil="true" />
            <graphicSymbol xsi:nil="true" />
          </graphicSymbolList>
          <annotationList>
            <genericAnnotationFeature xsi:nil="true" />
            <genericAnnotationFeature xsi:nil="true" />
          </annotationList>
          <network>
            <boardDist>string</boardDist>
            <taxDist>string</taxDist>
            <franchiseDist>string</franchiseDist>
            <schoolDist>string</schoolDist>
            <district>string</district>
            <county>string</county>
            <cityCode>string</cityCode>
            <city>string</city>
            <state>string</state>
            <postalCode>string</postalCode>
            <country>string</country>
            <section>string</section>
            <township>string</township>
            <range>string</range>
            <subdivision>string</subdivision>
            <block>string</block>
            <lot>string</lot>
          </network>
          <electricServiceList>
            <electricService xsi:nil="true" />
            <electricService xsi:nil="true" />
          </electricServiceList>
          <waterServiceList>
            <waterService xsi:nil="true" />
            <waterService xsi:nil="true" />
          </waterServiceList>
          <gasServiceList>
            <gasService xsi:nil="true" />
            <gasService xsi:nil="true" />
          </gasServiceList>
          <propaneServiceList>
            <propaneService xsi:nil="true" />
            <propaneService xsi:nil="true" />
          </propaneServiceList>
          <otherServiceList>
            <otherService xsi:nil="true" />
            <otherService xsi:nil="true" />
          </otherServiceList>
          <phoneList>
            <phoneNumber xsi:nil="true" />
            <phoneNumber xsi:nil="true" />
          </phoneList>
          <specialNeeds>string</specialNeeds>
          <serviceOrderList>
            <serviceOrder xsi:nil="true" />
            <serviceOrder xsi:nil="true" />
          </serviceOrderList>
          <workList>
            <workID>string</workID>
            <workID>string</workID>
            <work xsi:nil="true" />
            <work xsi:nil="true" />
          </workList>
          <workOrderList>
            <workOrder xsi:nil="true" />
            <workOrder xsi:nil="true" />
          </workOrderList>
          <maintenanceOrderList>
            <maintenanceOrder xsi:nil="true" />
            <maintenanceOrder xsi:nil="true" />
          </maintenanceOrderList>
          <contactInfo>
            <phoneList xsi:nil="true" />
            <eMailList xsi:nil="true" />
            <addressList xsi:nil="true" />
            <otherContactInformation xsi:nil="true" />
          </contactInfo>
        </serviceLocation>
      </installLocations>
      <responseURL>string</responseURL>
      <transactionID>string</transactionID>
    </InitiateMeterInstallation>
  </soap12:Body>
</soap12:Envelope>

